List<String> appyIDs = ["ID001", "ID002", "ID003"];
List<int> appyTypes = [0, 1, 2];

// 캐릭터 이름 (영문)
final List<String> appyNames = ["levi", "bobby", "nubi"];
// 캐릭터 이름 (한글)
final List<String> appyNamesKo = ["레비", "바비", "누비"];
// 캐릭터 이미지 파일명
final List<String> appySideImages = [
  "appy_levi_side.png",
  "appy_bobby_side.png",
  "appy_nubi_side.png"
];

final List<String> appyImages = [
  "appy_levi.png",
  "appy_bobby.png",
  "appy_nubi.png"
];

final List<int> appyLevels = [2, 3, 5];

// 일반 대사 데이터
final List<List<String>> characterTexts = [
  [
    "오늘은 무엇을 해볼까? 멋진 하루가 될 거야!",
    "힘들 땐 잠시 쉬어도 괜찮아. 넌 잘하고 있어!",
    "모든 순간을 즐겨봐. 넌 특별한 사람이야!",
    "오늘도 내 최고의 에피소드는 너랑 함께야!",
    "나랑 숨바꼭질 게임 해볼래? 시작한다!",
    "나도 가끔은 너랑 같이 출근하고 싶어!",
    "내가 항상 여기 있을게."
  ],
  [
    "안녕하세요, 오늘도 힘차게 하루를 시작해 봅시다!",
    "지금 힘들어도 결국엔 다 잘될 겁니다. 제가 믿습니다.",
    "여유를 가지세요. 세상은 천천히 가는 게 좋을 때도 있습니다.",
    "함께라면 더 좋은 결과를 만들 수 있습니다.",
    "따뜻한 차 한 잔으로 마음을 달래 보세요.",
    "어떤 일이든 의미를 찾으면 더 즐거워질 겁니다.",
    "언제나 응원하겠습니다. 천천히 가도 괜찮아요."
  ],
  [
    "여긴 참 깔끔하네. 내 취향이야.",
    "오늘은 그냥 천천히 가자.",
    "넌 참 괜찮은 사람이야. 항상 고마워.",
    "너랑 함께라면 어디든 좋아.",
    "말 했었나? 내가 제일 좋아해.",
    "그냥 이렇게 있는 것도 좋아.",
    "밥 먹었어? 안 먹었으면 빨리 챙겨."
  ]
];

final List<List<String>> snackTexts = [
  [
    "옴뇸뇸 맛있당",
    "고마워! 너도 하나 먹을래?",
    "내가 제일 좋아하는 맛이야!",
    "혹시 다른 맛은 없어...? 농담이야!",
    "사탕도 좋고 너도 좋아!"
  ],
  [
    "이 간식, 참 맛있네요. 같이 드실래요?",
    "좋은 음식을 나누는 건 참 행복한 일이죠.",
    "이런 맛은 오랜만이네요. 참 고맙습니다.",
    "사탕은 시원한게 최고죠.",
    "언제든 대접해 드리고 싶습니다. 함께 즐겨요."
  ],
  [
    "음... 이거 좋다. 너도 좋아할 거 같아.",
    "너가 준거라서 더 맛있네.",
    "간식은 늘 옳아. 그렇지?",
    "이거, 생각보다 맛있어. 고마워.",
    "다음에 또 줘."
  ]
];

final List<List<String>> firstMeetTexts = [
  [
    // "안녕! 난 너랑 함께할 오늘을 정말 기대하고 있어!",
    // "처음 만나서 반가워! 앞으로 우리 멋진 하루를 만들어가자!",
    // "와! 드디어 만나네! 함께라면 무슨 일이든 재밌을 거야!",
    // "이렇게 만나게 된 건 정말 운명 같아! 자, 이제 뭐부터 해볼까?",
    "안녕! 난 레비야. 우리 함께 최고의 에피소드를 써보자!"
  ],
  [
    // "안녕하세요, 처음 뵙겠습니다! 오늘도 좋은 날이 되길 바랍니다.",
    "만나서 반갑습니다! 앞으로 잘 부탁드리겠습니다.",
    // "이런 만남도 인연이겠죠? 잘 부탁드립니다.",
  ],
  [
    "안녕. 첫 만남인데도 편안해. 넌 괜찮은 사람 같아.",
  ]
];
